InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ТаймигОбъекта/Ext/Form/Module.bsl
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектТайминга = Параметры.ОбъектТайминга;
	
	ЗаполнитьДанные(СформироватьЗаголовокОбъекта());
	
	Элементы.ФормаЗаписать.Видимость = РольДоступна("ПолныеПрава");
	Элементы.ТаблицаТаймингаНорматив.ТолькоПросмотр = НЕ Элементы.ФормаЗаписать.Видимость;
	
КонецПроцедуры


Процедура ЗаполнитьДанные(СтруктураДанных)

    Если СтруктураДанных.ПКД Тогда
	
		ЗаполнитьДанныеПКД();	
	
	КонецЕсли;
	
	ТаблицаТайминга.Сортировать("ДатаНачала");

КонецПроцедуры


Функция СформироватьЗаголовокОбъекта()
	
	СтруктураДанных = Новый Структура("ПКД, ТЗ", ЛОжь, Ложь);
	
	ТипОбъекта = ТипЗнч(ОбъектТайминга);
	
	Если ТипОбъекта = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Задача ПКД";
		СтруктураДанных.ПКД = Истина;
	
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	
		Элементы.ОбъектТайминга.Заголовок = "Изделие комплект";	
		СтруктураДанных.ПКД = Истина;
		СтруктураДанных.ТЗ = Истина;
	
	КонецЕсли;
	
	Возврат СтруктураДанных;

КонецФункции

&НаКлиенте
Процедура ТаблицаТаймингаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТаймингаНормативПриИзменении(Элемент)
	ТД = Элементы.ТаблицаТайминга.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
	
		ТД.Изменен = Истина;
		
		Элементы.ФормаЗаписать.Доступность = Истина;
	
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДанныеПКД()
	
	Если ТипЗнч(ОбъектТайминга) = Тип("ЗадачаСсылка.Задачи_ПКД") Тогда
		ЗадачаТайминга = ОбъектТайминга;	
	Иначе
		ЗадачаТайминга = ПолучитьЗадачуПКД();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗадачаТайминга) Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураТаблиц = РегистрыСведений.ТаймингЗадач.ПолучитьТаймингиЗадач(ЗадачаТайминга);
	
	Для каждого Тайминг Из СтруктураТаблиц.ТайминЗадач Цикл
	
		НС = ТаблицаТайминга.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Тайминг);
		
		Если Тайминг.НормаВремени > 0 Тогда
		
			НС.Норматив = Тайминг.НормаВремени;	
		
		ИначеЕсли Тайминг.НормаВремениПоУмолчанию > 0 Тогда
		
			НС.Норматив = Тайминг.НормаВремениПоУмолчанию;	
			НС.НормативПоУмолчаению = Истина	
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗадачуПКД()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи_ПКД.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.Задачи_ПКД КАК Задачи_ПКД
		|ГДЕ
		|	Задачи_ПКД.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТайминга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	

КонецФункции // ПолучитьЗадачуПКД()


&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры
